package org.example;

import org.jsoup.Jsoup;
import org.jsoup.nodes.Document;
import org.jsoup.select.Elements;

import java.io.IOException;
import java.util.ArrayList;

public class Storage {
    private ArrayList<String> quoteList;
    Storage() {

        quoteList = new ArrayList<>();

        quoteList.add("Беседа двух американских чиновников:\n" +
                "— Слышали, что в России Северной столице проект платных парковок убыточным оказался?\n" +
                "— Как это возможно вообще? Проект же предполагает получение прибыли от платы за парковку. Неужели асфальт подорожал резко? Разметка на нем золотая? Как такое может быть? Как?\n" +
                "— Не знаю, но это доказательство тому, что для русских ничего невозможного нет.");
        quoteList.add("Разговор друзей:\n" +
                "— Слышал, что американцы чаще русских от депрессии страдают?\n" +
                "— Ага, зато русские чаще страдают от цирроза печени.");
        quoteList.add("Взял людоед в плен немца, американца, русского, притащил он их в свою пещеру, говорит:\n" +
                "— У меня здесь эхо. По очереди будете кричать. Того отпущу, чьи слова эхом будут повторяться дольше всего…\n" +
                "Американец кричит: «Обама!». Эхо повторило, потом тишина.\n" +
                "Немец кричит: «Гитлер!». Эхо повторило, потом тишина.\n" +
                "Русский орет: «Водку наливают!» Эхо: «Где, где, где, где, где, где, где». И так еще несколько часов.");
        quoteList.add("— Как среди всех гостей вычислить русского?\n" +
                "— А он по-русски уходит.\n" +
                "— А это как?\n" +
                "— Прощается долго, потом все спиртное выпивает, снова прощается и остается ночевать.");
        quoteList.add("— Как узнать русского на кассе в супермаркете?\n" +
                "— Русский, покупая бутылку лучшего виски, несколько бутылок французского шампанского," +
                " банку икры черной, банку икры красной, осьминога, сыр с голубой плесенью, шоколад бельгийский," +
                " достает из кармана полиэтиленовый пакет и говорит: «Пакетик пробивать не нужно».");
        quoteList.add("Русский, давно проживающий в Лондоне, решил слетать на родину. Возвращается назад," +
                " рассказывает другу:\n" +
                "— Да… Москва не так уже. На улицах много таджиков, чеченцев, дагестанцев, армян." +
                " Не подумайте ничего плохого. По-моему, они очень предприимчивые ребята." +
                " Но где же русские предприимчивые?\n" +
                "— Они в Лондоне.");
        quoteList.add("Три еврея схватили русского, говорят:\n" +
                "— Ну, все! Спаивать будем тебя сейчас! Так, вы ребята вдвоем держите его, а я наливать буду.\n" +
                "Русский:\n" +
                "— А можно, чтобы один держал, а двое наливали?");
        quoteList.add("Совсем не доброе утро. Двое новых русских. Один говорит:\n" +
                "— Братан, ты зачем вчера в ресторане 5 лимонов отдал арабу и попросил его," +
                " чтобы он тебе на своей родине валенки купил?\n" +
                "— Хорошо погуляли, ничего не скажешь…");
        quoteList.add("— Продолжите фразу «Моя крепость — это…».\n" +
                "Англичанин:\n" +
                "— Мой дом!\n" +
                "Американец:\n" +
                "— Моя машина!\n" +
                "Итальянец:\n" +
                "— Моя семья!\n" +
                "Русский:\n" +
                "— Крепость? Все, что не менее 40 градусов.");
        quoteList.add("Свела военная служба русского и английского офицеров, поспорили они," +
                " что дневальный русский сможет сам съесть одного теленка." +
                " Приготовили они из него всякой всячины: закуски, отбивные, котлеты, паштет." +
                " Сел дневальный за стол. Ест, ест, ест, ест, уже треть всего, что на столе было, съел." +
                " Вздыхает и говорит:\n" +
                "— А теленка когда подавать будете? Что-то я переживаю, что целого его теперь не съем.");

//        parser("https://anekdot-book.com/podborka/anekdoty-pro-russkih");
    }
    String getRandQuote() {
        int randValue = (int)(Math.random() * quoteList.size());
        return quoteList.get(randValue);
    }

//    void parser(String strURL) {
//        String className = "ads-color-box";
//        Document doc = null;
//        try {
//            //Получаем документ страницы
//            doc = Jsoup.connect(strURL).maxBodySize(0).get();
//        } catch (IOException e) {
//            e.printStackTrace();
//        }
//        //Получаем группу объектов, обращаясь методом из Jsoup к определенному блоку документа
//        Elements elQuote = doc.getElementsByClass(className);
//        //Достаем текст из каждого объекта поочереди и добавляем в нашу коллекцию
//        elQuote.forEach(el -> {
//            quoteList.add(el.text());
//        });
//    }
}