package org.example;

import java.util.ArrayList;

public class Storage {

    private ArrayList<String> quoteList;
    Storage() {

        quoteList = new ArrayList<>();
//        quoteList.add("Привет мои сладенькие хабаровчане, вот я и добралась до Вас");
//        quoteList.add("Есть тут смелые мужики, кто хочет сегодня ночью зажечь со мной");
//        quoteList.add("Почему молчите...или рядом с вами жены;) тогда намекните мне об этом");
//        quoteList.add("Почему молчите...или рядом с вами жены;) тогда намекните мне об этом");
//        quoteList.add("Мне кажется Вы перепили грузинское вино, уже не до женщин");
//        quoteList.add("Я высокая, спортивная и выносливая в постели, намек понятен мои жеребцы");
//        quoteList.add("Почему молчите...или рядом с вами жены;) тогда намекните мне об этом");
//        quoteList.add("Я начинаю межленно раздеваться, уже вся горю, где же ты");
//        quoteList.add("Хочу послать вам свое фото, чтобы вы понимали, что теряете");
//        quoteList.add("Да вы еще те шалуны, такое мне пишите на личный телефон");
//        quoteList.add("О Боже! нууу фото можно было и не посылать, я и так догадывалась");
//        quoteList.add("Ну все я готова, выбираю...ммм, Вы такие все классные, но мне нужен один");
//        quoteList.add("Много женатиков, чёрт...");
//        quoteList.add("Петя всегда ворчит, нет");
//        quoteList.add("Егор слишком спокойный, а мне нужен ураган, нет");
//        quoteList.add("Андрей слишком красивый, у меня будут конкурентки, нет");
//        quoteList.add("Илья любит спорить, а мне нужен послушный мальчик, нет");
//        quoteList.add("Миша, слишком далеко, а мне нужно сейчас мужского тела, нет");
//        quoteList.add("Иван, стал задротом компьютерным, нет");
//        quoteList.add("Кто же, ммм...");
//        quoteList.add("Гогито приходи ко мне, я тебя жду:)");
//        quoteList.add("Всем пока!");
    }
    String getRandQuote() {
        int randValue = (int)(Math.random() * quoteList.size());
        return quoteList.get(randValue);
    }
}