package org.example;

import java.util.ArrayList;

public class Storage {

    private ArrayList<String> quoteList;
    Storage() {

        quoteList = new ArrayList<>();
        quoteList.add("После очередной двойки по русскому языку, Коля обозвал учителя конем в пальте.");
        quoteList.add("Чукча бормочет русскому:\n" +
                "— Скажешь, сколько у меня оленей, обоих подарю!!!\n" +
                "— Два.\n" +
                "— Ого!! Ну ты колдун!!!");
        quoteList.add("На русском рынке:\n" +
                "— Мужчина, купите у меня часы! Это точные копии швейцарских часов!\n" +
                "— Давайте, беру. Держите точные копии российских рублей.");
        quoteList.add("Про дорожные знаки…\n" +
                "— Что для немца «кирпич» — то для русского «мигающий зелёный».");
        quoteList.add("Я тот человек, который не помнит ни одного правила по русскому языку," +
                " а знаки препинания расставляет на уровне интуиции и рефлексов.");
        quoteList.add("Кондуктор из Монголии до сих пор думает, что собирает с русских дань.");
        quoteList.add("Начальник читает анкету своего подчиненного. «На вопрос какими языками владеете?» в анкете написано:" +
                " «Тремями: русским литературным, руководящим и матерным».\n" +
                "— Тоже мне грамотей. Руководящий и матерный — это одно и тоже. Зачеркивает, выправляет: «Двумями».");
        quoteList.add("Когда начинаешь вникать в суть любой распродажи, вспоминаешь," +
                " что в русском языке слова «скидка» и «кидать» — однокоренные.");
        quoteList.add("Вся русская литература целиком построена на страдании. Страдает либо автор, либо персонажи, либо читатель.");
        quoteList.add("Двое русских альпинистов ползут по Эвересту. Один другому:\n" +
                "— Товарищ, долго нам ещё карабкаться?\n" +
                "— А вы видите воооооон ту базу?\n" +
                "— Нет.\n" +
                "— Тогда долго.");
        quoteList.add("Русским женщинам пришлось учиться «коней на скаку останавливать», чтобы принц мимо не проскакал.");
    }
    String getRandQuote() {
        int randValue = (int)(Math.random() * quoteList.size());
        return quoteList.get(randValue);
    }
}